Revit 2027 API
SolidUtils.CreateTransformed Method
 Creates a new Solid which is the transformation of the input Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Solid CreateTransformed(
	Solid solid,
	Transform transform
)
Public Shared Function CreateTransformed (
	solid As Solid,
	transform As Transform
) As Solid
public:
static Solid^ CreateTransformed(
	Solid^ solid,
	Transform^ transform
)
static member CreateTransformed :
        solid : Solid *
        transform : Transform -> Solid
Parameters
solid Solid
 The input solid to be transformed.
transform Transform
 The transform (which must be conformal).
Return Value
Solid
 The newly created Solid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  transform is not conformal. -or- transform has a scale that is negative or zero.
See Also
Reference
SolidUtils Class
Autodesk.Revit.DB Namespace